In [4]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    'name':['mohib', 'hassaan', 'ahmad', 'maaz'], 
    'marks':[92, 34, 24, 14],
    'city':['islamabad', 'rawalpindi', 'rawalpindi', 'islamabad']
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

      name  marks        city
0    mohib     92   islamabad
1  hassaan     34  rawalpindi
2    ahmad     24  rawalpindi
3     maaz     14   islamabad

In [8]:
df.to_csv('Mohib.csv')

In [9]:
df.to_csv('Mohib_indexFalse.csv', index=False)

In [10]:
mydata = pd.read_csv("Mohib.csv")

In [11]:
mydata

   Unnamed: 0     name  marks        city
0           0    mohib     92   islamabad
1           1  hassaan     34  rawalpindi
2           2    ahmad     24  rawalpindi
3           3     maaz     14   islamabad

In [12]:
mydata["marks"][1] = 72

C:\Users\HP\AppData\Local\Temp\ipykernel_11084\2968767832.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mydata["marks"][1] = 72

In [13]:
mydata

   Unnamed: 0     name  marks        city
0           0    mohib     92   islamabad
1           1  hassaan     72  rawalpindi
2           2    ahmad     24  rawalpindi
3           3     maaz     14   islamabad

In [14]:
df.to_csv('Mohib.csv', index=False)

In [16]:
 ser = pd.Series(np.random.rand(33))

In [18]:
ser
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [20]:
newdf

            0         1         2         3         4
0    0.699077  0.416630  0.157910  0.955859  0.827944
1    0.455144  0.991270  0.218873  0.894559  0.229388
2    0.341444  0.381913  0.372085  0.629267  0.123893
3    0.990005  0.936700  0.749112  0.240076  0.597547
4    0.640445  0.060523  0.151445  0.010882  0.368877
..        ...       ...       ...       ...       ...
329  0.635829  0.521523  0.373702  0.823717  0.710480
330  0.089205  0.868052  0.124112  0.540604  0.962556
331  0.314451  0.733733  0.428247  0.240409  0.984541
332  0.905677  0.509311  0.715795  0.352978  0.939338
333  0.930736  0.021893  0.150696  0.977093  0.286857

[334 rows x 5 columns]

In [21]:
newdf.to_csv("NewDF.csv")

In [22]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.518836    0.492190    0.522602    0.491766    0.509436
std      0.289258    0.297926    0.302146    0.286619    0.284209
min      0.000047    0.002514    0.001213    0.001265    0.000587
25%      0.259488    0.223129    0.252264    0.244827    0.268967
50%      0.529307    0.474644    0.540003    0.481604    0.531536
75%      0.766557    0.767051    0.795860    0.731098    0.740356
max      0.998019    0.999173    0.995772    0.994450    0.998994

In [26]:
newdf.loc[(newdf[0] < 0.05) & (newdf[2]>0.1)]

            0         1         2         3         4
42   0.000047  0.044730  0.539386  0.702009  0.586417
82   0.021573  0.038138  0.112578  0.279600  0.630152
96   0.024697  0.479577  0.423720  0.383020  0.732513
121  0.016566  0.528611  0.677459  0.513769  0.196438
147  0.049826  0.641601  0.452708  0.529924  0.595482
191  0.045370  0.881969  0.908059  0.192507  0.379004
196  0.008836  0.611695  0.204026  0.164160  0.524123
280  0.038086  0.809612  0.674165  0.991204  0.810395

In [28]:
mydf = pd.DataFrame(np.array([[12, 22], [25, 65], [15, 84]]))

In [29]:
mydf

    0   1
0  12  22
1  25  65
2  15  84

In [30]:
mydf.describe()

               0         1
count   3.000000   3.00000
mean   17.333333  57.00000
std     6.806859  31.76476
min    12.000000  22.00000
25%    13.500000  43.50000
50%    15.000000  65.00000
75%    20.000000  74.50000
max    25.000000  84.00000

In [31]:
mydf.mean()

0    17.333333
1    57.000000
dtype: float64

In [32]:
mydf.corr()

          0         1
0  1.000000  0.427808
1  0.427808  1.000000

In [33]:
mydf.count()

0    3
1    3
dtype: int64

In [34]:
mydf.max()

0    25
1    84
dtype: int32

In [35]:
mydf.min()

0    12
1    22
dtype: int32

In [36]:
mydf.std()

0     6.806859
1    31.764760
dtype: float64

In [37]:
mydf.median()

0    15.0
1    65.0
dtype: float64